{
  "title": "S03E01 Oscar Merry — What Joe Rogan Lost for $100M",
  "pubDate": "Thu, 22 Jan 2026 13:00:26 GMT",
  "duration": "4066",
  "artwork": "https://feeds.fountain.fm/OIYZniSDb9jd3Pb78CpF/items/BzxjjsLRnm1bp14hlk1s/files/COVER_ART---DEFAULT---6300ffed-b0d1-4502-8052-4ab976e49813.jpg",
  "description": "“If you choose to go exclusive on Spotify, you're essentially saying to 70% of your existing and potential audience, ‘Sorry, you can't listen anymore.’” Oscar Merry watched Joe Rogan lose influence despite a $100 million payday—and built Fountain to prove there's a better way.\nEpisode Summary\nOscar Merry's Alexa skills hit #1 in productivity and earned $30,000 in six months. He moved on when the technology couldn't match the vision—and the gatekeepers made clear it wasn't going to. Now as CEO of Fountain, he's building infrastructure for creators who want to own their audience rather than rent access to them. The conversation maps the entire value chain—from how legacy media takes up to 90% of creator revenue with quarterly payouts to how open protocols enable instant payments with single-digit fees. Merry unpacks the Joe Rogan case study as proof that even $100 million can't compensate for lost reach and explains why Nostr's cross-app comments represent the most significant shift in content discovery since RSS. For creators sensing that platform dependence is a liability, this episode lays out what's actually working in open podcasting today—and what's still hard.\nAbout the Guest\nOscar Merry is CEO and co-founder of Fountain, a podcast app built on open protocols including Bitcoin Lightning and Nostr. Before podcasting, he was an Amazon Alexa Champion who built skills used by millions, ran the London Alexa Meetup, and taught voice technology courses. He pivoted to audio after recognizing that voice assistants couldn't escape Big Tech gatekeeping. Based in the UK, he leads a small team building what he calls “a different way of doing content discovery on the internet.\"\nX/Twitter: https://twitter.com/MerryOscar\nNostr: primal.net/merryoscar\nLinkedIn: https://linkedin.com/in/oscarmerry\nFountain: https://fountain.fm\nKey Quotes\n“If you choose to go exclusive on Spotify, you're essentially saying to 70% of your existing and potential audience, sorry, you can't listen anymore.” — Oscar Merry\n“In the current system, as an artist, as a content creator, you are losing out massively on both time and money.” — Oscar Merry\n“Imagine if that YouTube comment could go into the Twitter feed or the Instagram feed or the LinkedIn feed. That conceptual difference that Nostr can deliver is the thing that lights up the eyes of podcasters.” — Oscar Merry\nKey Takeaways\nOpen podcasting is a check against centralization: Even Spotify's $100 million couldn't prevent Joe Rogan from losing influence during his exclusive period. The fragmented nature of podcasting—where Apple and Spotify together hold only ~30% market share—means exclusivity costs more than it pays.\nLegacy media takes up to 90% with quarterly delays: Between platforms, payment processors, labels, and collection agencies, creators can end up with 10 cents on the dollar months after the value was created. Open micropayments reverse this with instant settlement and single-digit fees.\nValue-based discovery beats attention algorithms: When a casual like and a life-changing experience are weighted equally, algorithms optimize for slop. Attaching payments to discovery signals lets quality surface over engagement bait.\nNostr inverts the flow for creators: Instead of audiences traveling to walled-off comment sections, engagement and money flow toward the creator across any app that speaks the protocol.\nTimestamps\n[01:08] Oscar's origin story: #1 Alexa skill to questioning Big Tech control\n[09:56] Why podcasting's fragmented ecosystem resists centralization\n[11:32] The Joe Rogan case study: $200M couldn't buy back lost influence\n[17:14] Why value for value can work when only 1-5% participate\n[26:10] What Fountain learned from listen-to-earn rewards\n[31:14] Money flow comparison: legacy media vs open payments\n[38:44] Attention algorithms vs value-based content discovery\n[47:43] Nostr's magic: comments that appear across every app\n[51:22] What censorship resistance actually means in practice\n[53:33] Building a business on unproven protocols\n[1:00:25] First moves for creators exploring open podcasting\n[1:03:18] The Fountain pitch: why switch from Spotify or Apple\nResources & Links\nMentioned in Episode:\nPrimal - Nostr client with built-in Lightning wallet\nPodcast Index - Open index for podcast RSS feeds\nAlby Hub - Self-hosted Lightning wallet for value-for-value payments\nPodcast:\nSubscribe: https://podcast.trustrevolution.co\nMusic: More Ghost Than Man"
}