{
  "title": "S02E16 Pippellia – Reputation Without a Kill Switch",
  "pubDate": "Thu, 18 Dec 2025 13:00:26 GMT",
  "duration": "4138",
  "artwork": "https://feeds.fountain.fm/OIYZniSDb9jd3Pb78CpF/items/VHM2DgApLFc8A5PB70Ly/files/COVER_ART---DEFAULT---271ea903-b539-44b0-9b0a-a6f80caa41ab.jpg",
  "description": "“Web of Trust is any network of relationship where trust is distributed and emergent—it's not imposed by someone else.” Pip builds the infrastructure that makes decentralized reputation actually work. While platforms like Twitter sell verification for $8, he's applying Google's PageRank algorithm to Nostr—and giving it away for free.\nEPISODE SUMMARY\nRight now, if you want to know whether an account is real or a bot, you're trusting Twitter or Meta to tell you. That model is failing—platforms can't stop spam, won't stop scams that pay for ads, and increasingly demand full KYC just to participate. Pip is building the alternative: Vertex, a Web of Trust service that computes reputation scores across Nostr's social graph. Instead of a company database deciding who you are, your reputation emerges from the people who actually know you. The technology uses PageRank-style algorithms to surface trustworthy accounts and filter out impersonators—without any central authority making those calls. For builders, this means spam protection and personalized recommendations without reinventing the wheel. For individuals, it means your identity and audience become portable—no platform can erase you because no platform owns you. Pip made Vertex free because Nostr needs adoption more than he needs revenue, a bet that infrastructure must reach critical mass before it can sustain itself.\nABOUT THE GUEST\nPip (Pippellia) is the co-founder of Vertex, a Web of Trust service for Nostr developers. He builds the infrastructure layer that helps decentralized apps solve their hardest problem: figuring out who to trust when there's no central authority. Vertex uses PageRank-style algorithms to compute reputation scores, enabling spam filtering, personalized recommendations, and impersonation protection. He received an OpenSats grant in 2025 and made Vertex free to drive adoption, prioritizing network growth over immediate revenue.\nX/Twitter: https://twitter.com/pippellia\nNostr: https://primal.net/p/nprofile1qqs0dqlgwq6l0t20gnstnr8mm9fhu9j9t2fv6wxwl3xtx8dh24l4auswr6u0j\nGitHub: https://github.com/pippellia-btc\nKEY QUOTES\n“Web of Trust is any network of relationship where trust is distributed and emergent. It emerges organically from interaction and connections—it's not imposed by someone else.” — Pip\n“Reputation is not a value, but it depends on the point of view. For me, your reputation is quite high because I follow you directly.” — Pip\n“Whatever you build, even if it's small, your audience on Nostr is gonna be yours forever—unless obviously you screw it up and people decide to leave you.” — Pip\nKEY TAKEAWAYS\nCentralized verification is broken by design: Platforms profit from bots inflating user counts and scammers paying for ads. Meta reportedly requires special permission to remove spammers whose ad budgets exceed certain thresholds—spam prevention conflicts with revenue.\nYour reputation should travel with you: On Nostr, if one app bans you, your identity and followers remain intact across every other client. Getting banned everywhere would require the entire network to decide you're toxic—a far higher bar than one company's content team.\nWeb of Trust solves the cold start problem for builders: Instead of building authentication systems, spam filters, and recommendation engines from scratch, developers can plug into existing reputation infrastructure and inherit the social graph's accumulated trust signals.\nPersonalized trust beats global authority: Different people can have different views on who's trustworthy. Vertex lets you borrow someone else's perspective—your technically-savvy friend's judgment on which app developers to trust, for example—without surrendering control to a platform.\nTIMESTAMPS\n[00:44] What Vertex is and the problem it solves\n[03:23] Why centralized trust verification is failing—the Twitter/X model\n[05:11] Pip's definition of Web of Trust: distributed and emergent trust\n[06:49] Why PGP's web of trust failed after 30 years\n[10:32] How Twitter's paid verification made identity meaningless\n[14:19] Meta's perverse incentives—when scammers pay more than spam costs\n[18:42] The primitives needed for healthy online discourse\n[21:26] Why reputation depends on point of view, not absolute values\n[27:13] How Nostr makes your audience portable and permanent\n[29:36] Can Web of Trust be weaponized? The exclusion question\n[34:52] Vertex's business model: freemium credits based on reputation\n[39:49] Why app store review models are going obsolete\n[41:57] Zapstore: using Web of Trust to verify app developers\n[49:00] What traditional developers get wrong about decentralized identity\n[55:21] What's next: explicit content detection and filtering\n[1:00:46] Personalized recommendations and onboarding without surveillance\nRESOURCES & LINKS\nMentioned in Episode:\nVertex - Web of Trust as a Service for Nostr\nnpub.world - Nostr profile search engine powered by Vertex for accurate discovery and verification\nZapstore - Permissionless app store using Web of Trust for developer verification\nCitadel Dispatch Episode 167 - Pip's previous interview with Matt Odell\nPodcast:\nSubscribe: https://podcast.trustrevolution.co\nMusic: More Ghost Than Man",
  "updatedAt": "2026-01-05T06:23:46.295Z"
}